org/Programming/resources/index.org
* people to learn from & be inspired by
- Joe Armstrong
- [[https://groups.csail.mit.edu/mac/users/gjs/gjs.html][Gerald Jay Sussman]]
- Casey Muratori

* Literature
- [[https://web.mit.edu/6.001/6.037/sicp.pdf][SICP]]
- Introduction to the Theory of Computation, Michael Sipser
- The Practice of Programming, Brian Kernighan, Rob Pike
# - Introduction to Formal Languages and Automata, Peter Linz
# - Nigel Cutland, "Introduction to Computability Theory";
# - Christos Papadimitriou, "Computational Complexity"

* Paradigms & Languages
** Lisp
[[../a-lispy-interlude/][Personal Summary of Lisp]]

** Functional Programming
[[https://mostly-adequate.gitbook.io/mostly-adequate-guide][Professor Frisby]]
  
* Lectures & Interviews
[[https://www.youtube.com/watch?v=xt1KNDmOYqA][Going from n to n+1 as a programmer - Casey Muratori]]
[[https://www.youtube.com/watch?v=lKXe3HUG2l4][The Mess We're In - Joe Armstrong]]
[[https://www.youtube.com/watch?v=ScEPu1cs4l0&t=2399s][Are we there yet? - Rich Hickey]]
[[https://www.youtube.com/watch?v=SxdOUGdseq4&list=PLUFeA6y-5sFkPkTN9Cx5H5pjQjhYKgeVI&index=6][Simple Made Easy - Rich Hickey]]
[[https://harfangk.github.io/2017/12/08/rich-hickey-interview-from-codequarterly.html#:~:text=Hickey%3A%20Yes%2C%20I%20was%20a%20music%20composition%20major%20in%20college][Interview on making Clojure - Rich Hickey]]

