html/Programming/resources/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta http-equiv="X-UA-Compatible" content="ie=edge">
<title>Blah</title>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.1.2/css/all.min.css" integrity="sha512-1sCRPdkRXhBV2PBLUdRb4tMg1w2YPf37qatUFeS7zlBy7jJI8Lf4VHwWfZZfpXtYSLy85pkm9GaYVYMfw5BC1A==" crossorigin="anonymous" referrerpolicy="no-referrer">
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css">
</head>
<body>
<div id="preamble" class="status">
<header>
      <span id="name-link"></span>
        <nav>
	  <ul>
	    <li><a href="mailto:email@ianstranathan.com"><i class="fa fa-envelope" aria-hidden="true"></i></a></li>
	    <li><a href="https://github.com/ianstranathan"><i class="fa-brands fa-github"></i></a></li>
	  </ul>
	</nav>
    </header>
</div>
<div id="content" class="content">
<div id="outline-container-org6c288bd" class="outline-2">
<h2 id="org6c288bd">people to learn from &amp; be inspired by</h2>
<div class="outline-text-2" id="text-org6c288bd">
<ul class="org-ul">
<li>Joe Armstrong</li>
<li><a href="https://groups.csail.mit.edu/mac/users/gjs/gjs.html">Gerald Jay Sussman</a></li>
<li>Casey Muratori</li>
</ul>
</div>
</div>

<div id="outline-container-org2c4e9b8" class="outline-2">
<h2 id="org2c4e9b8">Literature</h2>
<div class="outline-text-2" id="text-org2c4e9b8">
<ul class="org-ul">
<li><a href="https://web.mit.edu/6.001/6.037/sicp.pdf">SICP</a></li>
<li>Introduction to the Theory of Computation, Michael Sipser</li>
<li>The Practice of Programming, Brian Kernighan, Rob Pike</li>
</ul>
</div>
</div>

<div id="outline-container-org5956d3c" class="outline-2">
<h2 id="org5956d3c">Paradigms &amp; Languages</h2>
<div class="outline-text-2" id="text-org5956d3c">
</div>
<div id="outline-container-org4de5b87" class="outline-3">
<h3 id="org4de5b87">Lisp</h3>
<div class="outline-text-3" id="text-org4de5b87">
<p>
<a href="../a-lispy-interlude/">Personal Summary of Lisp</a>
</p>
</div>
</div>

<div id="outline-container-org7090199" class="outline-3">
<h3 id="org7090199">Functional Programming</h3>
<div class="outline-text-3" id="text-org7090199">
<p>
<a href="https://mostly-adequate.gitbook.io/mostly-adequate-guide">Professor Frisby</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org6376d38" class="outline-2">
<h2 id="org6376d38">Lectures &amp; Interviews</h2>
<div class="outline-text-2" id="text-org6376d38">
<p>
<a href="https://www.youtube.com/watch?v=xt1KNDmOYqA">Going from n to n+1 as a programmer - Casey Muratori</a>
<a href="https://www.youtube.com/watch?v=lKXe3HUG2l4">The Mess We're In - Joe Armstrong</a>
<a href="https://www.youtube.com/watch?v=ScEPu1cs4l0&amp;t=2399s">Are we there yet? - Rich Hickey</a>
<a href="https://www.youtube.com/watch?v=SxdOUGdseq4&amp;list=PLUFeA6y-5sFkPkTN9Cx5H5pjQjhYKgeVI&amp;index=6">Simple Made Easy - Rich Hickey</a>
<a href="https://harfangk.github.io/2017/12/08/rich-hickey-interview-from-codequarterly.html#:~:text=Hickey%3A%20Yes%2C%20I%20was%20a%20music%20composition%20major%20in%20college">Interview on making Clojure - Rich Hickey</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
    <p>All content on this site is © Ian Stranathan,
      <span id="current-year"></span>.
      <br>Use of this content for training AI or machine learning models is <em>not allowed</em>.
    </p>
  </footer>
<script>document.addEventListener('DOMContentLoaded', function() {
    const yearSpan     = document.getElementById('current-year');
    const h1_name_link = document.getElementById('name-link');
    if (yearSpan)
    {
      yearSpan.textContent = new Date().getFullYear();
    }
    if (h1_name_link)
    {
      // if the page is the main page, h1, else link to main page
      h1_name_link.innerHTML = window.location.href === "https://www.ianstranathan.com/" ? "<h1>Ian Stranathan</h1>" : '<h1><a href="https://www.ianstranathan.com/">Ian Stranathan</a></h1>'
    }
  });
</script>
</div>
</body>
</html>
